SwissAlertMap/app/controllers/positions_controller.rb

SELECT "positions".id FROM "positions" WHERE ("positions"."code" = '20') LIMIT 1
SELECT count(*) AS count_all FROM "positions"
---
  def show
    positions = []
    @position = Position.find(:first, :conditions => ["code = ?", params[:code]] )
    if @position
      positions = [@position]
    else
      positions = Position.recent
    end
    create_map_for_positions(positions)
    if @position
      @map.center_zoom_init([@position.latitude, @position.longitude], 12)
    else
      @map.center_zoom_init([46.751153, 8.245239], 8)
    end

    respond_to do |format|
      format.html # show.html.erb
      format.xml  { render :xml => @position }
      format.iphone do
        env = ENV['RAILS_ENV'] || RAILS_ENV
        apikey = YAML.load_file(RAILS_ROOT + '/config/gmaps_api_key.yml')[env]
        coordinates = "#{@position.latitude},#{@position.longitude}"
        zoom = 12
        @image_tag = "<img alt=\"Google Maps image\" src=\"http://maps.google.com/maps/api/staticmap?center=#{coordinates}&zoom=#{zoom}&size=320x416&mobile=true&markers=color:red|label:#{@position.code.first}|#{coordinates}&sensor=false&key=#{apikey}\" width=\"320\" height=\"416\" />"

INSERT INTO "positions" ("latitude", "created_at", "code", "updated_at", "longitude", "spell") VALUES(10.0, '2009-10-28 13:09:47', 'KRBSV', '2009-10-28 13:09:47', 10.0, 'Kilo Romeo Bravo Sierra Victor')
---
  def create
    position = Position.new
    position.latitude = params[:latitude]
    position.longitude = params[:longitude]

    if position.save